Catalogs/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидГрафика</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРабочихГрафиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммированныйУчетРабочегоВремени</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервыйВыходной</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойВыходной</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтсчета</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьРабочейНедели</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетНормыВремениПоОтдельномуГрафику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыНормыВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Смены</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерДня</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Смены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПериодыСмены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикиРаботыПоСменам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыПоСменам</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВечерниеЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НочныеЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикиРаботыПоВидамВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыПоВидамВремени</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДни</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДниСПраздниками</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>(Общ) Рабочий день</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДниНедели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ДниНедели</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Понедельник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четверг</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыРабочихГрафиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыРабочихГрафиков</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пятидневка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шестидневка</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сменный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыУчетаВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыУчетаВремени</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДням</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВечернимЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНочнымЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ГрафикиРаботы/Ext/ObjectModule.bsl
Перем мДлинаСуток Экспорт;
Перем ТаблицаДляЗаписи Экспорт;
Перем СписокИнтерваловРедактирования Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

Функция ПолучитьКоличествоЧасов(День, Смена, ЧасовВсего, ЧасовВечерних, ЧасовНочных)
	
	ЧасовВсего     = 0;
	ЧасовВечерних  = 0;
	ЧасовНочных    = 0;
	НачДня         = НачалоДня(День);
	
	НачалоВечерних     = 72000;  // 20:00:00
	ОкончаниеВечерних  = 79199;  // 21:59:59
	НачалоНочных1      = 0;      // 00:00:00
	ОкончаниеНочных1   = 21600;  // 06:00:00
	НачалоНочных2      = 79200;  // 22:00:00
	ОкончаниеНочных2   = 108000; // 06:00:00
	
	Для каждого ПериодСмены из Смена.ПериодыСмены Цикл
		
		ПериодСменыВремяНачала    = НачДня + (ПериодСмены.ВремяНачала - НачалоДня(ПериодСмены.ВремяНачала));
		ПериодСменыВремяОкончания = НачДня + (ПериодСмены.ВремяОкончания - НачалоДня(ПериодСмены.ВремяОкончания)) + ?(ПериодСмены.ВремяОкончания < ПериодСмены.ВремяНачала, мДлинаСуток, 0);
		
		ЧасовВсего = ЧасовВсего + (ПериодСменыВремяОкончания - ПериодСменыВремяНачала);
		
		НачалоВечернихЧасов = Макс(ПериодСменыВремяНачала, НачалоДня(День) + НачалоВечерних);
		ОкончаниеВечернихЧасов = Мин(ПериодСменыВремяОкончания, НачалоДня(День) + ОкончаниеВечерних);
		
		ЧасовВечерних = ЧасовВечерних + Макс(ОкончаниеВечернихЧасов - НачалоВечернихЧасов, 0);
		
		НачалоНочныхЧасов = Макс(ПериодСменыВремяНачала, НачалоДня(День) + НачалоНочных1);
		ОкончаниеНочныхЧасов = Мин(ПериодСменыВремяОкончания, НачалоДня(День) + ОкончаниеНочных1);
		
		ЧасовНочных = ЧасовНочных + Макс(ОкончаниеНочныхЧасов - НачалоНочныхЧасов, 0);
		
		НачалоНочныхЧасов = Макс(ПериодСменыВремяНачала, НачалоДня(День) + НачалоНочных2);
		ОкончаниеНочныхЧасов = Мин(ПериодСменыВремяОкончания, НачалоДня(День) + ОкончаниеНочных2);
		
		ЧасовНочных = ЧасовНочных + Макс(ОкончаниеНочныхЧасов - НачалоНочныхЧасов, 0);
		
	КонецЦикла;
	
	ЧасовВсего    = ЧасовВсего / 3600;
	ЧасовВечерних = ЧасовВечерних / 3600;
	ЧасовНочных   = ЧасовНочных / 3600;
	
КонецФункции

Функция ПолучитьКоличествоДнейВпроизводственномКалендаре(ДатаНачалаИнтервала, ДатаОкончанияИнтервала)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаИнтервала", ДатаНачалаИнтервала);
	Запрос.УстановитьПараметр("ДатаОкончанияИнтервала", ДатаОкончанияИнтервала);
	Запрос.Текст = "ВЫБРАТЬ
	| КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК КоличествоДней
	|ИЗ
	| РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|
	|ГДЕ
	| РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &ДатаНачалаИнтервала И
	| РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &ДатаОкончанияИнтервала";
	
	Результат  = Запрос.Выполнить();
	Выборка    = Результат.Выбрать();
	Выборка.Следующий();
	КоличествоДней = Выборка.КоличествоДней;
	Возврат КоличествоДней;
	
КонецФункции

Функция ВыходнойПоПроизводственномуКалендарю(индДата, ВидГрафика)
	
	ЗаписьРеглПроизвКалендаря = РегистрыСведений.РегламентированныйПроизводственныйКалендарь.СоздатьМенеджерЗаписи();
	ЗаписьРеглПроизвКалендаря.Год = Год(индДата);
	ЗаписьРеглПроизвКалендаря.ДатаКалендаря = индДата;
	ЗаписьРеглПроизвКалендаря.Прочитать();
	Если ЗаписьРеглПроизвКалендаря.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник тогда
		Возврат Истина;
	ИначеЕсли ЗаписьРеглПроизвКалендаря.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий тогда
		Возврат Ложь;
	ИначеЕсли ЗаписьРеглПроизвКалендаря.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота тогда
		Если ПервыйВыходной = Перечисления.ДниНедели.Суббота или ВторойВыходной = Перечисления.ДниНедели.Суббота тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ЗаписьРеглПроизвКалендаря.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье тогда
		Если ПервыйВыходной = Перечисления.ДниНедели.Воскресенье или ВторойВыходной = Перечисления.ДниНедели.Воскресенье тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции  //ВыходнойПоПроизводственномуКалендарю

Функция ПредпраздничныйПоПроизводственномуКалендарю(индДата, ВидГрафика)
	
	ЗаписьРеглПроизвКалендаря = РегистрыСведений.РегламентированныйПроизводственныйКалендарь.СоздатьМенеджерЗаписи();
	ЗаписьРеглПроизвКалендаря.Год = Год(индДата);
	ЗаписьРеглПроизвКалендаря.ДатаКалендаря = индДата;
	ЗаписьРеглПроизвКалендаря.Прочитать();
	Если ЗаписьРеглПроизвКалендаря.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции  //ПредпраздничныйПоПроизводственномуКалендарю
  

Процедура ОбработатьНаборЗаписейКалендаряДляАвтоматическогоЗаполнения(ДатаНачалаИнтервала, ДатаОкончанияИнтервала)
	
	Если НЕ ПроверитьПравильностьЗаполненияПериодовДляПятиШестидневки() тогда
		Сообщить(НСтр("ru='Количество часов за неделю не совпадает с расчетным!';uk='Кількість годин за тиждень не співпадає з розрахунковою!'"));
		Возврат;
	КонецЕсли;
	
 	Если ДатаНачалаИнтервала < ДатаОтсчета Тогда
 		Сообщить(НСтр("ru='Календарь не может быть заполнен на период, предшествующий указанной в нем дате отсчета!';uk='Календар не може бути заповнений на період, що передує зазначеній в ньому даті відліку!'"));
 		Возврат;
 	КонецЕсли;

	КоличествоДней = ПолучитьКоличествоДнейВпроизводственномКалендаре(ДатаНачалаИнтервала, ДатаОкончанияИнтервала);
	ДнейВИнтервале = Окр((ДатаОкончанияИнтервала - ДатаНачалаИнтервала) / мДлинаСуток);
	Если ДнейВИнтервале <> КоличествоДней тогда
		Сообщить(НСтр("ru='Проверьте правильность заполнения регламентированного производственного календаря';uk='Перевірте правильність заповнення регламентованого виробничого календаря'"), СтатусСообщения.Важное);
	КонецЕсли;
	
	Модифицированность = Истина;
	//КалендарьНаборЗаписей.Очистить();
	// сначала очистим записи за указанный период
	индДата = ДатаНачалаИнтервала;
	ПарамПоиска = Новый Структура("Дата");
	Пока индДата <= ДатаОкончанияИнтервала Цикл
		ПарамПоиска.Дата = индДата;
		СтрокиДляУдаления = ТаблицаДляЗаписи.НайтиСтроки(ПарамПоиска);
		Для каждого СтрокаУдаления из СтрокиДляУдаления Цикл
			ТаблицаДляЗаписи.Удалить(СтрокаУдаления);
		КонецЦикла;
		индДата = индДата + мДлинаСуток;
	КонецЦикла;
	
	КоличествоДнейВЦикле  = 0;
	ТаблицаСменПоДням   = Новый ТаблицаЗначений;
	ТипСмены     = Новый ОписаниеТипов("СписокЗначений");
	ТаблицаСменПоДням.Колонки.Добавить("СписокСмен", ТипСмены);
	
	Если ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный Тогда
	
		Для каждого НомерДня из Смены Цикл
			КоличествоДнейВЦикле = Макс(КоличествоДнейВЦикле, НомерДня.НомерДня);
			Если ТаблицаСменПоДням.Количество() < НомерДня.НомерДня тогда
				Пока Истина Цикл
					ТаблицаСменПоДням.Добавить();
					Если ТаблицаСменПоДням.Количество() = НомерДня.НомерДня тогда
						Прервать;
					КонецЕсли
				КонецЦикла;
			КонецЕсли;
			СтрокаизТаблицыПоДню = ТаблицаСменПоДням[НомерДня.НомерДня-1];
			СтрокаизТаблицыПоДню.СписокСмен.Добавить(НомерДня.Смена);
		КонецЦикла;
	
	КонецЕсли; 
	
 	ДнейВИнтервале = (НачалоДня(ДатаОкончанияИнтервала) - ДатаНачалаИнтервала)/мДлинаСуток+1;
	индДата   = '00000000';
	ЧасовВДне = Окр(ДлительностьРабочейНедели/?(ВидГрафика = Перечисления.ВидыРабочихГрафиков.Шестидневка,6,5));
	
	Для инд = 0 по ДнейВИнтервале-1 Цикл
		индДата = ДатаНачалаИнтервала + инд * мДлинаСуток;
		Если (ВидГрафика = Перечисления.ВидыРабочихГрафиков.Пятидневка) или (ВидГрафика = Перечисления.ВидыРабочихГрафиков.Шестидневка) тогда
			//Если КоличествоДнейВЦикле > 1 тогда
			// Сообщить("Для вида графика "+ВидГрафика+" количество дней в цикле графика не может быть больше 1");
			// Возврат;
			//КонецЕсли;
		КонецЕсли;
		Если  КоличествоДнейВЦикле > 0 тогда
			НомерДняДляСмены = ((индДата - ДатаОтсчета)/мДлинаСуток) % КоличествоДнейВЦикле;
			НомерДняДляСмены = ?(НомерДняДляСмены < 0, НомерДняДляСмены*-1, НомерДняДляСмены);
			СменыЗаДень   = ТаблицаСменПоДням[НомерДняДляСмены].СписокСмен;
			ИтогоЧасовВсего  = 0;
			ИтогоЧасовВечерних = 0;
			ИтогоЧасовНочных = 0;
			Для каждого ПериодДня из СменыЗаДень Цикл
				КоличествоЧасовВсего  = 0;
				КоличествоЧасовВечерних  = 0;
				КоличествоЧасовНочных  = 0;
				ЗаписьПоСменам = ТаблицаДляЗаписи.Добавить();//КалендарьНаборЗаписей.Добавить();
				ПолучитьКоличествоЧасов(индДата, ПериодДня.Значение, КоличествоЧасовВсего, КоличествоЧасовВечерних, КоличествоЧасовНочных);
				ЗаписьПоСменам.Дата     = индДата;
				ЗаписьПоСменам.Смена    = ПериодДня.Значение;
				ЗаписьПоСменам.Часы     = КоличествоЧасовВсего;
				ЗаписьПоСменам.ВечерниеЧасы = КоличествоЧасовВечерних;
				ЗаписьПоСменам.НочныеЧасы   = КоличествоЧасовНочных;
				//ИтогоЧасовВсего   = ИтогоЧасовВсего  + КоличествоЧасовВсего;
				//ИтогоЧасовВечерних  = ИтогоЧасовВечерних + КоличествоЧасовВечерних;
				//ИтогоЧасовНочных  = ИтогоЧасовНочных + КоличествоЧасовНочных;
			КонецЦикла;
		Иначе // дней в цикле нет!
			Если (ВидГрафика = Перечисления.ВидыРабочихГрафиков.Пятидневка) или (ВидГрафика = Перечисления.ВидыРабочихГрафиков.Шестидневка) тогда
				ИтогоЧасовВсего  = 0;
				ИтогоЧасовВечерних = 0;
				ИтогоЧасовНочных = 0;
				ЗаписьПоСменам  = ТаблицаДляЗаписи.Добавить();//КалендарьНаборЗаписей.Добавить();
				Если (ЗначениеЗаполнено(ПервыйВыходной) и (Перечисления.ДниНедели.Индекс(ПервыйВыходной) = (ДеньНедели(индДата)-1))) или
					(ЗначениеЗаполнено(ВторойВыходной) и (Перечисления.ДниНедели.Индекс(ВторойВыходной) = (ДеньНедели(индДата)-1))) 
					или ВыходнойПоПроизводственномуКалендарю(индДата, ВидГрафика) тогда

					ЗаписьПоСменам.Дата     = индДата;
					ЗаписьПоСменам.Смена    = Ссылка;
					ЗаписьПоСменам.Часы     = 0;
					ЗаписьПоСменам.ВечерниеЧасы   = 0;
					ЗаписьПоСменам.НочныеЧасы   = 0;
					
				ИначеЕсли ПредпраздничныйПоПроизводственномуКалендарю(индДата, ВидГрафика) Тогда
					
					ПолучитьКоличествоЧасов(индДата, Ссылка, КоличествоЧасовВсего, КоличествоЧасовВечерних, КоличествоЧасовНочных);
					ЗаписьПоСменам.Дата     = индДата;
					ЗаписьПоСменам.Смена    = Ссылка;
					ЗаписьПоСменам.Часы     = КоличествоЧасовВсего - 1;
					ЗаписьПоСменам.ВечерниеЧасы   = КоличествоЧасовВечерних;
					ЗаписьПоСменам.НочныеЧасы   = КоличествоЧасовНочных;
					
				Иначе
					
					ПолучитьКоличествоЧасов(индДата, Ссылка, КоличествоЧасовВсего, КоличествоЧасовВечерних, КоличествоЧасовНочных);
					ЗаписьПоСменам.Дата     = индДата;
					ЗаписьПоСменам.Смена    = Ссылка;
					ЗаписьПоСменам.Часы     = КоличествоЧасовВсего;
					ЗаписьПоСменам.ВечерниеЧасы   = КоличествоЧасовВечерних;
					ЗаписьПоСменам.НочныеЧасы   = КоличествоЧасовНочных;

				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ОтмеченВРесурсеПроизводственногоКалендаря(ПроверяемаяДата, Ресурс, ТаблицаДанныхКалендаря) Экспорт
	
	НайденнаяСтрока = ТаблицаДанныхКалендаря.Найти(ПроверяемаяДата, "ДатаКалендаря");
	Если НайденнаяСтрока = Неопределено тогда
		Возврат 0;
	КонецЕсли;
	Возврат НайденнаяСтрока[Ресурс];
	
КонецФункции

Процедура ПоместитьТаблицуВТаблицуДляЗаписи(ТаблицаПоместить, ТаблицаДляЗаписи, ДатаНачалаИнтервала, ДатаОкончанияИнтервала) Экспорт
	
	СтруктураПоиска = Новый Структура("Дата");
	СтруктураПоискаВТаблицеЗаписи = Новый Структура("Дата");
	
	ДнейВТекущемМесяце = Окр((ДатаОкончанияИнтервала - ДатаНачалаИнтервала) / мДлинаСуток); 
	ДатаМесяца = ДатаНачалаИнтервала;
	Для индДата = 0 по ДнейВТекущемМесяце-1 Цикл
		ДатаМесяца = ДатаНачалаИнтервала + индДата * мДлинаСуток;
		// попробуем найти строку с соответствующей датой в таблице ИЗ которой помещаем
		СтруктураПоиска.Дата = ДатаМесяца;
		
		НайдСтрокиПоместить = ТаблицаПоместить.НайтиСтроки(СтруктураПоиска);

		Если НайдСтрокиПоместить.Количество() > 0 Тогда
			
			// удалим имевшиеся ранее строки
			СтруктураПоискаВТаблицеЗаписи.Дата = ДатаМесяца;
			НайдСтроки = ТаблицаДляЗаписи.НайтиСтроки(СтруктураПоискаВТаблицеЗаписи);
			Если НайдСтроки.Количество()>0 Тогда
				Для каждого СтрокаТЗ Из НайдСтроки Цикл
					ТаблицаДляЗаписи.Удалить(СтрокаТЗ)
				КонецЦикла; 
			КонецЕсли;
			
			// нашли строки и теперь их поместим
			Для каждого СтрокаТЗ Из НайдСтрокиПоместить Цикл
	            ЗаполнитьЗначенияСвойств(ТаблицаДляЗаписи.Добавить(),СтрокаТЗ);
			КонецЦикла;
		Иначе
			// если не нашли строку, Тогда удалим соответствующую строку из другой таблицы
			НайдСтроки = ТаблицаДляЗаписи.НайтиСтроки(СтруктураПоиска);
			Для каждого СтрокаТаблицыДляЗаписи Из НайдСтроки Цикл
				ТаблицаДляЗаписи.Удалить(СтрокаТаблицыДляЗаписи);
			КонецЦикла; 

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Отбирает данные за переданный интервал дат из регистра сведений
//
// Параметры: 
//  ДатаНачалаИнтервалаКалендаря - начало интервала дат
//  ДатаОкончанияИнтервалаКалендаря - окончание интервала дат
//
// Возвращаемое значение:
//  Нет.
//
Процедура ЗаполнитьТаблицуЗаИнтервал(ДатаНачалаИнтервалаКалендаря, ДатаОкончанияИнтервалаКалендаря) Экспорт
	
	ДнейВИнтервале = Окр((ДатаОкончанияИнтервалаКалендаря - ДатаНачалаИнтервалаКалендаря)/мДлинаСуток);
	Для инд = 0 по ДнейВИнтервале - 1 Цикл
		индДата    = ДатаНачалаИнтервалаКалендаря + инд * мДлинаСуток;
	КонецЦикла;
	ЗапросПоСменам = Новый Запрос;
	ЗапросПоСменам.УстановитьПараметр("ДатаНачалаИнтервалаКалендаря",  ДатаНачалаИнтервалаКалендаря);
	ЗапросПоСменам.УстановитьПараметр("ДатаОкончанияИнтервалаКалендаря", ДатаОкончанияИнтервалаКалендаря);
	ЗапросПоСменам.УстановитьПараметр("ГрафикРаботы", Ссылка);
	
	ЗапросПоСменам.Текст = "ВЫБРАТЬ
	| ГрафикиРаботыПоСменам.Дата,
	| ГрафикиРаботыПоСменам.Смена,
	| ГрафикиРаботыПоСменам.Часы,
	| ГрафикиРаботыПоСменам.ВечерниеЧасы,
	| ГрафикиРаботыПоСменам.НочныеЧасы
	|ИЗ
	| РегистрСведений.ГрафикиРаботыПоСменам КАК ГрафикиРаботыПоСменам
	|
	|ГДЕ
	| ГрафикиРаботыПоСменам.ГрафикРаботы = &ГрафикРаботы И
	| ГрафикиРаботыПоСменам.Дата >= &ДатаНачалаИнтервалаКалендаря И 
	| ГрафикиРаботыПоСменам.Дата <= &ДатаОкончанияИнтервалаКалендаря";
	
	РезультатЗапроса  = ЗапросПоСменам.Выполнить();
	ВременныйНаборЗаписей = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ПоместитьТаблицуВТаблицуДляЗаписи(ВременныйНаборЗаписей, ТаблицаДляЗаписи, ДатаНачалаИнтервалаКалендаря, ДатаОкончанияИнтервалаКалендаря);
	
КонецПроцедуры

// заполняет календарь за определенный временной интервал
Процедура ЗаполнитьКалендарьЗаИнтервал(ДатаИнтервала) Экспорт
	
	ДатаНачалаИнтервала    	= НачалоГода(ДатаИнтервала);
	ДатаОкончанияИнтервала  = КонецГода(ДатаИнтервала);
	ОбработатьНаборЗаписейКалендаряДляАвтоматическогоЗаполнения(ДатаНачалаИнтервала, ДатаОкончанияИнтервала);
	индМес  = 0;
	ДатаМесяца = ДобавитьМесяц(ДатаНачалаИнтервала, индМес);
	Пока ДатаМесяца <= ДатаОкончанияИнтервала Цикл
		Если СписокИнтерваловРедактирования.НайтиПоЗначению(ДатаМесяца) = Неопределено тогда
			СписокИнтерваловРедактирования.Добавить(ДатаМесяца);
		КонецЕсли;
		ДатаМесяца = ДобавитьМесяц(ДатаНачалаИнтервала, индМес);
		индМес  = индМес + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьПравильностьЗаполненияПериодовДляПятиШестидневки() Экспорт
	
	СуммаВремени = 0; ЧасовВДне = 0;
	Для каждого ПериодДня из ПериодыСмены Цикл
		СуммаВремени = СуммаВремени + Час(ПериодДня.ВремяОкончания)*3600 + Минута(ПериодДня.ВремяОкончания)*60 + Секунда(ПериодДня.ВремяОкончания) - (Час(ПериодДня.ВремяНачала)*3600 + Минута(ПериодДня.ВремяНачала)*60 + Секунда(ПериодДня.ВремяНачала));
	КонецЦикла;
	
	Если ВидГрафика = Перечисления.ВидыРабочихГрафиков.Пятидневка тогда
		ЧасовВДне = ДлительностьРабочейНедели / 5;
	ИначеЕсли ВидГрафика = Перечисления.ВидыРабочихГрафиков.Шестидневка тогда
		ЧасовВДне = ДлительностьРабочейНедели / 6;
	ИначеЕсли ВидГрафика = Перечисления.ВидыРабочихГрафиков.Сменный тогда
		Возврат Истина;
	КонецЕсли;
	
	РасхождениеВоВремени = ЧасовВДне * 3600 - СуммаВремени;
	
	Возврат РасхождениеВоВремени < 60 и РасхождениеВоВремени > - 60 // допускаем погрешность в минуту

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка И НЕ ПроверитьПравильностьЗаполненияПериодовДляПятиШестидневки() тогда
		Сообщить(НСтр("ru='Количество часов за неделю не совпадает с расчетным!';uk='Кількість годин за тиждень не співпадає з розрахунковою!'"));
	КонецЕсли;
	
	Если НЕ ОбменДанными.Загрузка Тогда
	
		// Получим таблицу сведений о производственном календаре за нужные месяцы
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивМесяцев", СписокИнтерваловРедактирования.ВыгрузитьЗначения());
		Запрос.Текст = "ВЫБРАТЬ
		               |	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
		               |	РегламентированныйПроизводственныйКалендарь.КалендарныеДни,
		               |	РегламентированныйПроизводственныйКалендарь.ВидДня
		               |ИЗ
		               |	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		               |
		               |ГДЕ
		               |	(НАЧАЛОПЕРИОДА(РегламентированныйПроизводственныйКалендарь.ДатаКалендаря, МЕСЯЦ) В (&МассивМесяцев))";
		РезультатЗапроса = Запрос.Выполнить();
		ПроизводственныйКалендарь = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.Прямой);
		
		Для каждого ДатаИзСписка из СписокИнтерваловРедактирования Цикл
			ДатаНачалаИнтервалаИзСписка  = НачалоМесяца(ДатаИзСписка.Значение);
			ДатаОкончанияИнтервалаИзСписка = КонецМесяца(ДатаИзСписка.Значение);
			
			индДата   = '00000000';
			ДнейВИнтервале = Окр((ДатаОкончанияИнтервалаИзСписка - ДатаНачалаИнтервалаИзСписка) / мДлинаСуток);
			
			НаборЗаписейЗаДеньПоСменам = РегистрыСведений.ГрафикиРаботыПоСменам.СоздатьНаборЗаписей();
			НаборЗаписейЗаДеньПоСменам.Отбор.ГрафикРаботы.Значение       = Ссылка;
			НаборЗаписейЗаДеньПоСменам.Отбор.ГрафикРаботы.Использование  = Истина;
			НаборЗаписейЗаДеньПоСменам.Отбор.Дата.ВидСравнения           = ВидСравнения.Равно;
			НаборЗаписейЗаДеньПоСменам.Отбор.Дата.Использование          = Истина;
			
			НаборЗаписейЗаДеньПоВремени = РегистрыСведений.ГрафикиРаботыПоВидамВремени.СоздатьНаборЗаписей();
			НаборЗаписейЗаДеньПоВремени.Отбор.ГрафикРаботы.Значение       = Ссылка;
			НаборЗаписейЗаДеньПоВремени.Отбор.ГрафикРаботы.Использование  = Истина;
			НаборЗаписейЗаДеньПоВремени.Отбор.Дата.ВидСравнения           = ВидСравнения.Равно;
			НаборЗаписейЗаДеньПоВремени.Отбор.Дата.Использование          = Истина;
			СтруктураПоиска   = Новый Структура("Дата");
			
			Для инд = 0 по ДнейВИнтервале - 1 Цикл
				ИтогоЧасовВсего    = 0;
				ИтогоЧасовВечерних = 0;
				ИтогоЧасовНочных   = 0;
				
				индДата = ДатаНачалаИнтервалаИзСписка + инд * мДлинаСуток;
				НаборЗаписейЗаДеньПоСменам.Отбор.Дата.Значение = индДата;
				НаборЗаписейЗаДеньПоВремени.Отбор.Дата.Значение = индДата;
				
				СтруктураПоиска.Дата = индДата;
				НайденныеСтроки      = ТаблицаДляЗаписи.НайтиСтроки(СтруктураПоиска);
				// выбрали строки по дате, теперь будем их записывать
				Для каждого СтрокаТаблицаДляЗаписи   из НайденныеСтроки   Цикл
					
					КоличествоЧасовВсего     = СтрокаТаблицаДляЗаписи.Часы;
					КоличествоЧасовВечерних  = СтрокаТаблицаДляЗаписи.ВечерниеЧасы;
					КоличествоЧасовНочных    = СтрокаТаблицаДляЗаписи.НочныеЧасы;
					
					ЗаписьПоСменам = НаборЗаписейЗаДеньПоСменам.Добавить();
					
					ЗаписьПоСменам.ГрафикРаботы   = Ссылка;
					Если ВидГрафика <> Перечисления.ВидыРабочихГрафиков.Сменный тогда
						ЗаписьПоСменам.Смена      = Ссылка;
					Иначе
						ЗаписьПоСменам.Смена      = СтрокаТаблицаДляЗаписи.Смена;
					КонецЕсли;
					ЗаписьПоСменам.Дата           = индДата;
					ЗаписьПоСменам.Часы           = СтрокаТаблицаДляЗаписи.Часы;
					ЗаписьПоСменам.ВечерниеЧасы   = СтрокаТаблицаДляЗаписи.ВечерниеЧасы;
					ЗаписьПоСменам.НочныеЧасы     = СтрокаТаблицаДляЗаписи.НочныеЧасы;
					
					ИтогоЧасовВсего     = ИтогоЧасовВсего    + КоличествоЧасовВсего;
					ИтогоЧасовВечерних  = ИтогоЧасовВечерних + КоличествоЧасовВечерних;
					ИтогоЧасовНочных    = ИтогоЧасовНочных   + КоличествоЧасовНочных;
					
				КонецЦикла;
				НаборЗаписейЗаДеньПоСменам.Записать(Истина);
				НаборЗаписейЗаДеньПоСменам.Очистить();
				
				ЗаписьПоВУВ = НаборЗаписейЗаДеньПоВремени.Добавить();
				ЗаписьПоВУВ.ГрафикРаботы      = Ссылка;
				ЗаписьПоВУВ.ВидУчетаВремени   = Перечисления.ВидыУчетаВремени.ПоДням;
				ЗаписьПоВУВ.ОсновноеЗначение  = ?(ИтогоЧасовВсего > 0, 1, 0);
				ЗаписьПоВУВ.ДополнительноеЗначение = ИтогоЧасовВсего;
				ЗаписьПоВУВ.Дата     = индДата;
				ЗаписьПоВУВ.ПроизводственныйКалендарьКалендарныеДни = ОтмеченВРесурсеПроизводственногоКалендаря(индДата, "КалендарныеДни", ПроизводственныйКалендарь);
				ЗаписьПоВУВ.ПроизводственныйКалендарьКалендарныеДниСПраздниками = 1;
				
				ЗаписьПоВУВ = НаборЗаписейЗаДеньПоВремени.Добавить();
				ЗаписьПоВУВ.ГрафикРаботы           = Ссылка;
				ЗаписьПоВУВ.ВидУчетаВремени        = Перечисления.ВидыУчетаВремени.ПоЧасам;
				ЗаписьПоВУВ.ОсновноеЗначение       = ИтогоЧасовВсего;
				ЗаписьПоВУВ.ДополнительноеЗначение = ?(ИтогоЧасовВсего > 0, 1, 0);
				ЗаписьПоВУВ.Дата     = индДата;
				ЗаписьПоВУВ.ПроизводственныйКалендарьКалендарныеДни = ОтмеченВРесурсеПроизводственногоКалендаря(индДата, "КалендарныеДни", ПроизводственныйКалендарь);
				ЗаписьПоВУВ.ПроизводственныйКалендарьКалендарныеДниСПраздниками = 1;
				
				ЗаписьПоВУВ = НаборЗаписейЗаДеньПоВремени.Добавить();
				ЗаписьПоВУВ.ГрафикРаботы      = Ссылка;
				ЗаписьПоВУВ.ВидУчетаВремени   = Перечисления.ВидыУчетаВремени.ПоВечернимЧасам;
				ЗаписьПоВУВ.ОсновноеЗначение  = ИтогоЧасовВечерних;
				ЗаписьПоВУВ.Дата     = индДата;
				// ПроизводственныйКалендарьКалендарныеДни
				// ПроизводственныйКалендарьКалендарныеДниСПраздниками
				// ДополнительноеЗначение
				// не записываются для ПоЧасам
				
				ЗаписьПоВУВ = НаборЗаписейЗаДеньПоВремени.Добавить();
				ЗаписьПоВУВ.ГрафикРаботы      = Ссылка;
				ЗаписьПоВУВ.ВидУчетаВремени   = Перечисления.ВидыУчетаВремени.ПоНочнымЧасам;
				ЗаписьПоВУВ.ОсновноеЗначение  = ИтогоЧасовНочных;
				ЗаписьПоВУВ.Дата     = индДата;
				// ПроизводственныйКалендарьКалендарныеДни
				// ПроизводственныйКалендарьКалендарныеДниСПраздниками
				// ДополнительноеЗначение
				// не записываются для ПоЧасам
				
				НаборЗаписейЗаДеньПоВремени.Записать(Истина);
				НаборЗаписейЗаДеньПоВремени.Очистить();
			КонецЦикла;
		КонецЦикла;
		
		ТаблицаДляЗаписи.Очистить();
		СписокИнтерваловРедактирования.Очистить();
	
	КонецЕсли; 
	
КонецПроцедуры

мДлинаСуток = 86400; // в секундах
ТаблицаДляЗаписи    = Новый ТаблицаЗначений; 
ТаблицаДляЗаписи.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
ТаблицаДляЗаписи.Колонки.Добавить("Смена", Новый ОписаниеТипов("СправочникСсылка.Смены"));
ТаблицаДляЗаписи.Колонки.Добавить("Часы", Новый ОписаниеТипов("Число"));
ТаблицаДляЗаписи.Колонки.Добавить("ВечерниеЧасы", Новый ОписаниеТипов("Число"));
ТаблицаДляЗаписи.Колонки.Добавить("НочныеЧасы",  Новый ОписаниеТипов("Число"));
МаксДатаОкончанияИнтервала = '00000000';
МинДатаНачалаИнтервала  = '22000101';
СписокИнтерваловРедактирования = Новый СписокЗначений();
